Revit 2021.1 API
ShapeImporter Properties
The ShapeImporter type exposes the following members.
Properties
Name | Description
DefaultLengthUnit
 The length unit to be used if not specified in the input SAT file.
InputFormat
 The format of the incoming data.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ShapeImporter Class
Autodesk.Revit.DB Namespace